In [10]:
from pandas import Series, DataFrame
import pandas as pd
import numpy as np

In [9]:
# Series
list_data = [1,2,3,4,5]
example_obj = Series(data = list_data)
example_obj

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [11]:
list_data = [1,2,3,4,5]
list_name = ['A','B','C','D','E']
example_obj = Series(data = list_data, index = list_name)
example_obj

A    1
B    2
C    3
D    4
E    5
dtype: int64

In [12]:
dict_data = {'A':1, 'B':2, 'C':3, 'D':4, 'E':5}
example_obj = Series(dict_data, dtype=np.float32, name="example_data")
example_obj

A    1.0
B    2.0
C    3.0
D    4.0
E    5.0
Name: example_data, dtype: float32

In [13]:
example_obj['A'] # data index에 접근

1.0

In [14]:
example_obj['A'] = 3.2 # data index에 값 할당
example_obj

A    3.2
B    2.0
C    3.0
D    4.0
E    5.0
Name: example_data, dtype: float32

In [15]:
# DataFrame
# Example from - https://chrisalbon.com/python/pandas_map_values_to_values.html
raw_data = {'first_name': ['Jason', 'Molly', 'Tina', 'Jake', 'Amy'],
        'last_name': ['Miller', 'Jacobson', 'Ali', 'Milner', 'Cooze'],
        'age': [42, 52, 36, 24, 73],
        'city': ['San Francisco', 'Baltimore', 'Miami', 'Douglas', 'Boston']}
df = pd.DataFrame(raw_data, columns = ['first_name', 'last_name', 'age', 'city'])
df

  first_name last_name  age           city
0      Jason    Miller   42  San Francisco
1      Molly  Jacobson   52      Baltimore
2       Tina       Ali   36          Miami
3       Jake    Milner   24        Douglas
4        Amy     Cooze   73         Boston

In [16]:
DataFrame(raw_data, columns = ["age", "city"]) # columns : 특정 column만 가져올 수 있음

   age           city
0   42  San Francisco
1   52      Baltimore
2   36          Miami
3   24        Douglas
4   73         Boston

In [17]:
DataFrame(raw_data, columns = ["first_name", "last_name", "age", "city", "debt"])
# 새로운 column을 넣을 수도 있다.(Not a Number형태로 생성)

  first_name last_name  age           city debt
0      Jason    Miller   42  San Francisco  NaN
1      Molly  Jacobson   52      Baltimore  NaN
2       Tina       Ali   36          Miami  NaN
3       Jake    Milner   24        Douglas  NaN
4        Amy     Cooze   73         Boston  NaN

In [18]:
df = DataFrame(raw_data, columns = ["first_name","last_name","age", "city", "debt"])
df.first_name

0    Jason
1    Molly
2     Tina
3     Jake
4      Amy
Name: first_name, dtype: object

In [19]:
df["first_name"] # 위와 같이 2가지 방법으로 사용할 수 있다.

0    Jason
1    Molly
2     Tina
3     Jake
4      Amy
Name: first_name, dtype: object

In [20]:
# loc : index의 이름을 가지고 특정 위치에 접근
df.loc[1] # loc[1] : index 1번의 데이터를 가져옴

first_name        Molly
last_name      Jacobson
age                  52
city          Baltimore
debt                NaN
Name: 1, dtype: object

In [21]:
# iloc : index의 위치를 가지고
df["age"].iloc[1:] # 1부터 끝가지 추출하되, age만 가져오라

1    52
2    36
3    24
4    73
Name: age, dtype: int64

In [22]:
s = pd.Series(np.nan, index=[49,48,47,46,45, 1, 2, 3, 4, 5])
s

49   NaN
48   NaN
47   NaN
46   NaN
45   NaN
1    NaN
2    NaN
3    NaN
4    NaN
5    NaN
dtype: float64

In [23]:
s.loc[:3]

49   NaN
48   NaN
47   NaN
46   NaN
45   NaN
1    NaN
2    NaN
3    NaN
dtype: float64

In [24]:
s.iloc[:3]

49   NaN
48   NaN
47   NaN
dtype: float64

In [28]:
df.debt = df.age > 40
df

  first_name last_name  age           city   debt
0      Jason    Miller   42  San Francisco   True
1      Molly  Jacobson   52      Baltimore   True
2       Tina       Ali   36          Miami  False
3       Jake    Milner   24        Douglas  False
4        Amy     Cooze   73         Boston   True

In [29]:
df.values # 값을 array형태로 출력

array([['Jason', 'Miller', 42, 'San Francisco', True],
       ['Molly', 'Jacobson', 52, 'Baltimore', True],
       ['Tina', 'Ali', 36, 'Miami', False],
       ['Jake', 'Milner', 24, 'Douglas', False],
       ['Amy', 'Cooze', 73, 'Boston', True]], dtype=object)

In [30]:
del df["debt"] # del : 데이터 삭제